Hi,
It seems that the implementation of the linking should be in the same module and actually on the same resource definition. Otherwise terraform will create a new resource with the same name. On OCI console you will see that the status of the LPGs (which carry the same name) is connected.

I did a separate test by creating the resource first and with a second terraform run provide the id for the LPG, what I noticed is that the peer_id value setting from null to a valid id will recreate the gateway resource (it seems that it counts as an update). 

Shall I assume that LPG should not be managed via terraform?

Here is the output:

```
  # module...oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"] must be replaced
-/+ resource "oci_core_local_peering_gateway" "local_peering_gateway" {
        compartment_id               = "ocid1..."
      ~ defined_tags                 = {} -> (known after apply)
        display_name                 = "OCI-APP-network-LPG"
      ~ freeform_tags                = {} -> (known after apply)
      ~ id                           = "ocid1..." -> (known after apply)
      ~ is_cross_tenancy_peering     = false -> (known after apply)
      + peer_advertised_cidr         = (known after apply)
      ~ peer_advertised_cidr_details = [] -> (known after apply)
      + peer_id                      = "ocid1..." # forces replacement
      ~ peering_status               = "NEW" -> (known after apply)
      ~ peering_status_details       = "Not connected to a peer." -> (known after apply)
      + route_table_id               = (known after apply)
      ~ state                        = "AVAILABLE" -> (known after apply)
      ~ time_created                 = "2020-09-07 15:07:41.917 +0000 UTC" -> (known after apply)
        vcn_id                       = "ocid1..."

module....module.OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"]: Destroying... [id=ocid1...]
module....module.OCI_DMZ_app_network.data.oci_core_subnets.cloud_network_data: Refreshing state...
module....module.OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"]: Destruction complete after 0s
module....module.OCI_DB_network_LPG.oci_core_local_peering_gateway.local_peering_gateway["OCI-APP-network-LPG"]: Creating...

Error: Service error:InvalidParameter. Either Local Peering Gateway with ID ocid1... does not exist or you are not authorized to access it.. http status code: 400. Opc request id: ...

```

Thanks, 
Viktor